<?php

namespace Database\Seeders;

use App\Models\Lesson;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class LessonSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $lessons = [
            [0, 0, "101", "درس عمومی-1", 1],
            [1, 1, "102", "درس عمومی-2", 1],
            [2, 2, "103", "درس عمومی-3", 1],
            [3, 3, "104", "درس عمومی-4", 1],
            [4, 4, "105", "درس عمومی-5", 1],
            [5, 5, "106", "درس عمومی-6", 1],
            [6, 6, "107", "درس عمومی-7", 1],
            [7, 7, "108", "درس عمومی-8", 1],
            [8, 8, "109", "درس عمومی-9", 1],

            [9, 9, "201", "درس پایه-1", 1],
            [10, 10, "202", "درس پایه-2", 1],
            [11, 11, "203", "درس پایه-3", 1],
            [12, 12, "204", "درس پایه-4", 1],
            [13, 13, "205", "درس پایه-5", 1],
            [14, 14, "206", "درس پایه-6", 1],
            [15, 15, "207", "درس پایه-7", 1],
            [16, 16, "208", "درس پایه-8", 1],
            [17, 17, "209", "درس پایه-9", 1],
            [18, 18, "210", "درس پایه-10", 1],
            [19, 19, "211", "درس پایه-11", 1],
            [20, 20, "212", "درس پایه-12", 1],

            [21, 21, "301", "درس تخصصی-1", 2],
            [22, 22, "302", "درس تخصصی-2", 2],
            [23, 23, "303", "درس تخصصی-3", 2],
            [24, 24, "304", "درس تخصصی-4", 2],
            [25, 25, "305", "درس تخصصی-5", 2],
            [26, 26, "306", "درس تخصصی-6", 2],
            [27, 27, "307", "درس تخصصی-7", 2],
            [28, 28, "308", "درس تخصصی-8", 2],
            [29, 29, "309", "درس تخصصی-9", 2],
            [30, 30, "310", "درس تخصصی-10", 2],
            [31, 31, "311", "درس تخصصی-11", 2],
            [32, 32, "312", "درس تخصصی-12", 2],
            [33, 33, "313", "درس تخصصی-13", 2],
            [34, 34, "314", "درس تخصصی-14", 2],
            [35, 35, "315", "درس تخصصی-15", 2],
            [36, 36, "316", "درس تخصصی-16", 2],
            [37, 37, "317", "درس تخصصی-17", 2],
            [38, 38, "318", "درس تخصصی-18", 2],
            [39, 39, "319", "درس تخصصی-19", 2],
            [40, 40, "320", "درس تخصصی-20", 2],
            [41, 41, "321", "درس تخصصی-21", 2],
            [42, 42, "322", "درس تخصصی-22", 2],
            [43, 43, "323", "درس تخصصی-23", 2],
            [44, 44, "324", "درس تخصصی-24", 2],
            [45, 45, "325", "درس تخصصی-25", 2],
        ];

        foreach ($lessons as $lesson) {
            Lesson::create([
                "lesson_id" => $lesson[1],
                "lesson_code" => $lesson[2],
                "lesson_title" => $lesson[3],
                "lesson_count" => $lesson[4],
            ]);
        }
    }
}
