<?php
//ترکیب اساتید با دروسی که می توانند درس بدهند
// نام اساتیدی که در لیست نیست به این معنی است که استاد درس توانایی بالایی دارد و میتواند هر چیزی را درس دهد
// آیتم اول مربوط به آیدی استادو آیتم دوم آرایه ای از گروه های درسی که استاد مهارت دارد و آیتم سومی مربوط به دروسی است که می تواند درس دهد
$hosh_professors_avalible_lessons = [
    [0,[2],[21,22,23]],
    [3,[1],[]],
    [1,[2],[21,22,23]],
    [5,[1,2],[]],
    [2,[1],[]],
    [4,[0,1],[]],
];

// ارتباط میان گروه های دانشجویی و دروس با یکدیگر
// آیدی اول مربوط به درس و آیدی دوم مربوط به گروه درسی است
// آیدی دروسی که در لیست نیستند مربوط به تمامی دانشجویان می باشد
$hosh_student_group_course = [
    [31,0], [31,1], [31,2],
    [32,0],
    [33,1], [33,2],
    [34,1], [34,2], [34,3],
];
